/* eslint-disable */
<template>
  <div class="agreement_container">
    <p>2020沃尔玛未来零售创想大赛 个人信息保护政策</p>
 <br/>本政策仅适用于沃尔玛（中国）投资有限公司举办的2020沃尔玛未来零售创想大赛（“大赛”）中收集、处理、保存和传输的个人信息。
 <br/>生效日期：2020年6月30日。
 <br/>如果您有任何疑问、意见或建议，请通过以下方式与我们联系：
 <br/>名称：沃尔玛（中国）投资有限公司
 <br/>地址：深圳市福田区农林路69号深国投广场二号楼2-5层及三号楼1-12层
 <br/>个人信息保护负责人: 沃尔玛中国隐私合规领域专家cnprivacy@walmart.com
 <br/>本政策将帮助您了解一下内容：
 <br/>一、  我们收集哪些您的个人信息
 <br/>二、  我们如何使用您的个人信息
 <br/>三、  我们如何使用 Cookies 和同类技术
 <br/>四、  我们如何共享、转让、公开披露您的个人信息
 <br/>五、  我们如何保存您的个人信息
 <br/>六、  我们如何保护您的个人信息
 <br/>七、  您的权利
 <br/>八、  我们如何处理儿童的个人信息
 <br/>九、  您的个人信息如何在全球范围转移
 <br/>十、  本政策如何更新
 <br/>十一、  您如何联系我们
 <br/>沃尔玛（中国）投资有限公司（“我们”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
 <br/>请在使用我们的网站前，仔细阅读并了解本《个人信息保护政策》。
 <br/>一、  我们收集哪些您的个人信息
 <br/>个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。您选择参加我们举办的大赛，需要您向我们提供或允许我们收集的必要信息，包括如下个人信息：
 <br/>1  个人基本资料：个人姓名、个人电话号码、电子邮箱；
 <br/>二、  个人教育信息：个人学校、学历、专业；我们如何使用您的个人信息
 <br/>我们仅会出于本政策所述的目的，收集和使用您的个人信息。对于上述所列举的个人信息，我们会用来建立参赛队伍及队员信息管理、通知赛程进展。如果您拒绝提供或拒绝同意我们收集这些信息，您将无法注册参加大赛，请您立即停止访问我们的网站。
 <br/>(一)  大赛报名以及账户注册
 <br/>为了报名大赛，如果您尚未注册，您需要首先注册您的大赛账户。您需要向我们提供您的手机号码以及您收到的短信验证码注册并登录账户。您注册成功后，您可以使用您的手机号码和您设置的密码登录您的账户。
 <br/>(二)  发送与大赛相关的信息
 <br/>在您注册成为我们的用户后，我们仍可能会使用您的手机号码或电子邮件向您发送与大赛相关的重要信息，例如企业导师对接、复赛及决赛晋级名单公布、沟通决赛选手差旅、比赛细节提醒。
 <br/>(三)  发送与沃尔玛招聘相关的信息
 <br/>我们会将您的信息同步至沃尔玛人才库，为了让您了解您可能感兴趣的岗位招聘。我们可能会通过手机号码向您发送招聘信息、沃尔玛岗位信息。您可以按照本政策第七条（四）款的操作拒绝接收招聘广告信息。
 <br/>(四)  在以下情形中，我们也会收集、使用您个人信息，但请您充分知晓，这些收集和使用无需征得您的授权同意：
 <br/>1.  与国家安全、国防安全直接相关的；
 <br/>2.  与公共安全、公共卫生、重大公共利益直接相关的；
 <br/>3.  与犯罪侦查、起诉、审判和判决执行等直接相关的；
 <br/>4.  出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
 <br/>5.  所收集的个人信息是您自行向社会公众公开的；
 <br/>6.  从合法公开披露的信息中收集到您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
 <br/>7.  根据您的要求签订合同所必需的；
 <br/>8.  用于维护所提供的产品和/或服务的安全稳定运行所必需的，例如发现、处置产品和/或服务的故障；
 <br/>9.  为新闻单位且其在开展合法的新闻报道所必需的；
 <br/>10.  学术研究机构出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
 <br/>11.  法律法规规定的其他情形。
 <br/>三、  我们如何使用 Cookies 和同类技术
 <br/>(一)    我们对Cookies的使用
 <br/>1  为确保您使用我们的网站基于Cookies实现的特色服务和功能，以及确保您正常登录我们的网站， 我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，以便在您下次在此计算机或移动设备上登录时能辨认出该计算机或移动设备。Cookies 通常包含标识符、站点名称以及一些号码和字符，Cookies不会跟踪个人信息。来自我们的网站的Cookies只能被我们的网站读取。
 <br/>2  我们不会将 Cookies 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookies。有关详情，请参见About Cookies.org。您可以清除计算机或移动设备上保存的所有 Cookies。大部分网络浏览器的设置均为自动接受Cookies，但您可以通过修改浏览器的设置，开启阻止Cookies的功能以拒绝 Cookies；另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，则您需要在每一次访问我们的网站时亲自更改用户设置，而且之前通过Cookies所记录的信息也会被删除，并且可能会对您正常登录我们的网站有一定影响。
 <br/>(二)   我们对Cookie同类技术的使用
 <br/>除 Cookies 外，我们还会在我们的网站上使用内嵌Web链接等同类技术。我们的网站可能通过调用h5的代码，即在h5中暴露全局对象（包括方法）后，实现页面跳转到Web面直接访问。内嵌Web链接使我们能够通过网站向您及时发布或更新活动页面及文字公告。
 <br/>四、  我们如何共享、转让、公开披露您的个人信息
 <br/>(一)  共享
 <br/>我们不会与本公司以外的任何公司、组织和个人分享您的个人信息，除非获得您的明确同意。目前，我们会在以下情形中，向您征求您对共享个人信息的授权同意：
 <br/>1  我们与我们的关联方共享您的个人信息。我们会与我们的关联方共享向您收集的个人信息，但这些共享都会受本政策所声明的目的的约束，将主要用于数据存储、销售记录及财务对账。我们只会在必要的情况下与我们的关联方共享您的个人信息，且受本政策中所声明目的的约束。我们的关联方如要改变个人信息的处理目的，将再次征求您的授权同意。
 <br/>我们的关联方是指，我们的产品和/或服务的运营方现在或将来控制、受控制或与其处于共同控制下的任何公司、机构。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被人民法院认定的方式，其中特别包括Wal-Mart Inc.
 <br/>2  我们会与我们的合作伙伴共享您的相关个人信息，仅为实现本政策中声明的目的。我们的某些服务将由我们的合作伙伴提供。因此，为保障向您提供相关服务及您的用户体验，我们可能会与我们的合作伙伴共享您的相关个人信息。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。
 <br/>我们可能会将您的姓名、手机号码、电子邮件、学校、学历、专业信息共享给我们的大赛服务供应商——北京网聘咨询有限公司深圳分公司（智联招聘）。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理个人信息。
 <br/>(二)  转让
 <br/>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
 <br/>1  在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
 <br/>2  在涉及合并、并购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此个人信息保护政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
 <br/>(三)  公开披露
 <br/>1.  我们仅会在以下情形下，公开披露您的个人信息：
 <br/>(1)  获得您明确同意后；
 <br/>(2)  基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
 <br/>(3)  当我们收到基于法律、法规、司法、法律程序、政府主管部门强制性的行政执法要求而提出的披露您个人信息的要求时，我们会请求提出要求的相关部门出具合理的文件，以确保该等要求具备合法的依据并且相关执法部门具有合法的权利和合理的目的获取您的个人信息。我们不会公开披露您的个人生物识别信息、基因信息。
 <br/>2.  在以下情形中，我们也会共享、转让或公开披露您的个人信息，但请您充分知晓，这些共享、转让或公开披露无需征得您的授权同意：
 <br/>(1)  与我们履行法律法规规定的义务相关的；
 <br/>(2)  与国家安全、国防安全直接相关的；
 <br/>(3)  与公共安全、公共卫生、重大公共利益直接相关的；
 <br/>(4)  与犯罪侦察、起诉、审判和判决执行等直接相关的；
 <br/>(5)  出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
 <br/>(6)  您自行向社会公众公开的个人信息；
 <br/>(7)  从合法公开披露的信息中收集到您的个人信息的，如合法的新闻报道、政府信息公开等渠道。
 <br/>五、  我们如何保存您的个人信息
 <br/>我们会将按照本政策收集到的您的个人信息存储在中华人民共和国境内。我们会将您本次大赛的报名信息，包括您的姓名、手机号码、电子邮件、学校、学历、专业信息保存至我们的人才库中，以便日后向您进行岗位推荐，招聘信息推送。如果您不想接收这些信息，可以按照第七条(四) 款中列举的方式拒绝我们的推送。您也可以申请注销账户，在收到您的注销账户申请并验证您的身份后，我们将立即安排注销，并会停止使用您在注册账户时提供的相应的个人信息并对您的这些个人信息进行删除或匿名化处理。
 <br/>六、  我们如何保护您的个人信息
 <br/>(一)  我们对您的个人信息采取的安全保护措施
 <br/>1  我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息，例如：
 <br/>(1)  我们会使用加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离；
 <br/>(2)  我们会使用受信赖的保护机制防止数据遭到恶意攻击；
 <br/>(3)  我们会部署访问控制机制，确保只有授权人员才能访问个人信息（严格数据访问权限限制/多重身份认证技术等）；
 <br/>(4)  我们会采用代码安全自动检查、数据访问日志分析技术进行个人信息安全审计；
 <br/>(5)  我们会举办安全和隐私保护培训课程，加强员工对于个人信息安全保护重要性的认识。
 <br/>2  我们已建立关于个人信息保护的制度以及专门人员：
 <br/>(1)  我们将建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用；
 <br/>(2)  我们将通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制；
 <br/>(3)  我们已建立信息保护专职部门、数据安全应急响应组织来推进和保障个人信息安全；
 <br/>(4)  我们仅允许有必要知晓这些信息的我们及我们关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与我们的合作关系；
 <br/>(5)  我们会采取一切合理可行的措施，确保未收集无关的个人信息。
 <br/>(二)  您积极的自我保护对于确保您个人信息的安全也至关重要
 <br/>互联网并非绝对安全的环境，而且无法确定电子邮件、即时通讯、社交软件等与其他用户的交流方式是否加密。我们强烈建议您不要通过此类方式发送您的个人信息，并且在使用此类工具时也请设置复杂密码。
 <br/>如您的账户设有密码保护，我们建议您不要将您的密码告诉任何人。我们不会主动给您打电话或发电子邮件要求您告知密码。同时，请您在停止或暂停使用本网站前记得注销您的登录并关闭窗口，以避免别人知晓您的登录信息，并由此侵害您的个人信息。
 <br/>(三)  您提供个人信息后可能存在的安全风险及我们应承担的法律责任
 <br/>互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
 <br/>(四)  个人信息安全事件的告知
 <br/>在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
 <br/>七、  您的权利
 <br/>按照中国相关的法律、法规、标准，我们保障您对自己的个人信息行使以下权利：
 <br/>(一)  访问您的个人信息
 <br/>有权访问您的个人信息，除律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：登录大赛报名系统—点击我的信息-查看个人信息。
 <br/>如果您无法通过上述途径访问这些个人信息，您可以随时发送电子邮件至XXX获得指引。我们将在15天内回复您的访问请求。
 <br/>(二)  更正您的个人信息
 <br/>当您发现我们处理的关于您的个人信息有错误时，您有权要求我们作出更正。您可以通过“（一） 访问您的个人信息”中罗列的方式提出更正申请。如果您无法通过上述途径更正这些个人信息，您可以随时发送电子邮件至XXX获得指引。我们将在15天内回复您的访问请求。
 <br/>(三)  删除您的个人信息
 <br/>在以下情形中，您可以向我们提出删除个人信息的请求：
 <br/>1.  如果我们处理个人信息的行为违反法律法规；
 <br/>2.  如果我们收集、使用您的个人信息，却未征得您的同意；
 <br/>3.  如果我们处理个人信息的行为违反了与您的约定；
 <br/>4.  如果您不再使用我们的产品或服务，或您注销了账号；
 <br/>5.  如果我们不再为您提供产品或服务。
 <br/>若我们决定相应您的删除请求，我们还将通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
 <br/>当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。
 <br/>(四)  改变您授权同意的范围
 <br/>您可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。
 <br/>请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息得处理。
 <br/>  如果您不想接受我们给您发送的招聘广告信息，您随时可以通过以下方式取消：
 <br/>A.  您可以根据广告短信内容提示，来取消我们给您发送的手机广告短信；
 <br/>B.  您可以通过XXX联系客服来获知如何拒绝接收我们的招聘广告信息。
 <br/>(五)  个人信息主体注销账户
 <br/>您有权要求注销您的账户，如您确定注销您的账户，请通过XXX联系客服，在客服人员核实您的身份和您注销账户的要求后，您的账户将会被注销。我们善意地提醒您：账户注销后您的注册信息将将丧失且账户不可恢复使用，您也无法找回账户相关的任何内容或信息；您注销之前的报名记录将做无效处理。您可以再次以新用户的身份注册并报名参加大赛。我们会依据您的要求，删除您的个人信息，法律法规另有规定的除外。
 <br/>(六)  响应您的上述请求
 <br/>为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在收到您关于身份验证的反馈并完成验证后的十五天内答复您的请求。如果您对于我们的答复不满意，还可以通过以下第十部分提供的方式进行申诉或投诉。
 <br/>对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
 <br/>在以下情形中，按照法律法规要求，我们将无法响应您的请求：
 <br/>1.  与我们履行法律法规规定的义务相关的；
 <br/>2.  与国家安全、国防安全直接相关的；
 <br/>3.  与公共安全、公共卫生、重大公共利益直接相关的；
 <br/>4.  与犯罪侦查、起诉和审判等直接相关的；
 <br/>5.  有充分证据表明您存在主观恶意或滥用权利的；
 <br/>6.  出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
 <br/>7.  响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
 <br/>8.  涉及商业秘密的。
 <br/>八、  我们如何处理儿童的个人信息
 <br/>本次大赛主要面向成人。如果没有父母或监护人的同意，儿童不应创建自己的个人信息主体账户。
 <br/>对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
 <br/>尽管当地法律和习俗对儿童的定义不同，但我们将不满14周岁的任何人均视为儿童。
 <br/>如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
 <br/>九、  您的个人信息如何在全球范围转移
 <br/>原则上，我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。
 <br/>由于我们通过位于美国的资源和服务器提供部分产品或服务，这意味着，在获得您的授权同意后，我们根据本政策向您收集的个人信息，包括您的个人信息可能会被转移到美国，或者受到来自美国的访问。
 <br/>美国设有不同的数据保护法，在这种情况下，我们会确保您的个人信息在美国得到与在中华人民共和国境内同等的保护。例如，我们会在跨境数据转移之前实施去标识化等安全措施。
 <br/>十、  本政策如何更新
 <br/>我们的个人信息保护政策可能变更。
 <br/>未经您明确同意，我们不会削减您按照本个人信息保护政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
 <br/>对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明个人信息保护政策的具体变更内容）。
 <br/>本隐私政策所指的重大变更包括但不限于：
 <br/>1.  我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
 <br/>2.  我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
 <br/>3.  个人信息共享、转让或公开披露的主要对象发生变化；
 <br/>4.  您参与个人信息处理方面的权利及其行使方式发生重大变化；
 <br/>5.  我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
 <br/>6.  个人信息安全影响评估报告表明存在高风险时。
 <br/>我们还会将本隐私政策的旧版本存档，供您查阅。
 <br/>十一、  您如何联系我们
 <br/>如果您对个人信息保护政策有任何疑问、意见或建议，请通过以下方式与我们联系：
 <br/>邮箱地址
 <br/>(一)  如您发现自己的个人信息泄露，尤其是您的账户及密码发生泄露，请您立即通过以上任一方式联系我们，以便我们及时采取适当的措施。
 <br/>(二)  我们设立了【个人信息保护负责人】，您可以通过发送邮件至【cnprivacy@walmart.com】的方式与其联系。
 <br/>(三)  一般情况下，我们将在十五天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过以下外部途径寻求解决方法：向网信、电信、公安及工商等监管部门进行投诉或举报。
    <div @click="toLogin" class="back_login">
      返回注册
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    toLogin () {
      this.$router.push('/login')
    }
  }
}
</script>

<style lang="scss" scoped>
  .agreement_container {
    padding: 0 10px;
    .back_login {
      position: fixed;
      bottom: 20px;
      right: 0px;

      padding: 5px 10px;

      background-color: rgba(0, 0, 0, 0.5);
      box-shadow:1px 2px 10px 0px rgba(0, 0, 0, 0.3);
      color: #fff;
      font-size: 12px;
      cursor: pointer;
    }
    p {
      text-align: center;

      font-size: 16px;
      font-weight: bold;
    }
  }
</style>
